import React from 'react';

type Props = {};

const Cabinet = (props: Props) => {
  return <div className='pt-10 text-center text-base font-semibold'>Welcome to your personal dashboard!</div>;
};

export default Cabinet;

// Створи маршрут з назвою яка тобі потрібна ,в ньому створи layout ,створи компонент зі списком маршрутів в твоєму випадку шапка з лінками,імпортуй його в цей layout ,нижче кинь чілдрени.

// Далі а папці цього ж створеного маршруту створи пьять твоїх маршрутів які будуть приймати інформацію на свою індивідуальну сторінку ,і ці всі пʼять маршрутів і будуть твоїми чілдренами,які будуть рендериьись під шапкою в залежності від кліка на лінк

// По маршруту example ти перейдеш на сторінку з шапкою .якщо потрібно щоб одразу відкривалась потрібна сторінка то пропиши example/personal-data

// cabinet/user